Revit 2026 API

# RebarUpdateCurvesDataGetHookPlaneNormalForBarIdx Method

---

**Note: This API is now obsolete.**

Returns the plane's normal in which the termination at end of bar with index barPositionIndex that is currently in Rebar. The normal is used for both hook and crank.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationPlaneNormalForBarIdx instead.")]
public XYZ GetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationPlaneNormalForBarIdx instead.")>
Public Function GetHookPlaneNormalForBarIdx (
	end As Integer,
	barPositionIndex As Integer
) As XYZ
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationPlaneNormalForBarIdx instead.")]
XYZ^ GetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationPlaneNormalForBarIdx instead.")>]
member GetHookPlaneNormalForBarIdx :
        end : int *
        barPositionIndex : int -> XYZ
```

#### Parameters

end Int32
     The end of bar. Should be 0 for start or 1 for end.
barPositionIndex Int32
     An index between 0 and (GetNumberOfBars()-1).

#### Return Value

XYZ The plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex that is currently in Rebar. The normal is used for both hook and crank.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, GetNumberOfBars()-1 ]. -or- Invalid end. |

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace